# CrossSection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..CrossSection Property
SpecTypeId Class See Also
---
Cross Section, in discipline HVAC.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CrossSection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CrossSection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CrossSection {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace